import { v4 as uuidv4 } from 'uuid';

export const books = [
    {
        id: uuidv4(),
        imageSrc: 'https://ir.ozone.ru/s3/multimedia-3/wc1000/6025569579.jpg',
        name: 'Властелин Колец. Братство кольца',
        descrContent: `Трилогия "Властелин Колец" - одна из тех великих книг, встреча с которыми становится Событием. Эпическая красота повествования, вечная тема борьбы Добра и Зла, большой подвиг маленького героя и, самое главное, - тот фантастический и вместе с тем удивительно реальный мир, в котором хочется остаться навсегда.`,
        category: 'Приключения',
        price: 1060,
    },
    {
        id: uuidv4(),
        imageSrc: 'https://ir.ozone.ru/s3/multimedia-h/wc1000/6025574381.jpg',
        name: 'Властелин Колец. Две крепости',
        descrContent: `Трилогия "Властелин Колец" — одна из тех великих книг, встреча с которыми становится Событием. Эпическая красота повествования, вечная тема борьбы Добра и Зла, большой подвиг маленького героя и, самое главное, — тот фантастический и вместе с тем удивительно реальный мир, в котором хочется остаться навсегда.
        Издание, которое вы держите в руках, выполненное в переводе Владимира Грушецкого и Наталии Григорьевой и оформленное знаменитым художником Денисом Гордеевым, — не просто книга на все времена, не просто культовое фэнтези от одного из самых известных писателей, но произведение искусства, сочетающее в себе волшебство слова и рисунка.`,
        category: 'Приключения',
        price: 980,
    },
    {
        id: uuidv4(),
        imageSrc: 'https://ir.ozone.ru/s3/multimedia-b/wc1000/6342648803.jpg',
        name: 'Властелин Колец. Возвращение короля',
        descrContent: `Перед вами трилогия "Властелин Колец". Своеобразная "Библия от фэнтези". Книга Книг ХХ века. Самое популярное, самое читаемое, самое культовое произведение ушедшего столетия. Стены Минас-Тирита, крепости Последней Надежды, осаждают бесчисленные рати Черного Властелина Саурона. Повелитель сил Тьмы уже готов праздновать победу, не замечая в упоении собственной мощью двух маленьких человечков, приближающихся к Роковой Горе, чтобы уничтожить Кольцо Всевластия. От мужества полуросликов зависит судьба всего Средиземья…`,
        category: 'Приключения',
        price: 900,
    },
    {
        id: uuidv4(),
        imageSrc: 'https://ir.ozone.ru/s3/multimedia-l/wc1000/6155183745.jpg',
        name: 'Гарри Поттер и философский камень',
        descrContent: `Первая книга Джоан Роулинг из серии о Гарри Поттере. Одиннадцатилетний мальчик-сирота Гарри Поттер живет в семье своей тетки и даже не подозревает, что он - настоящий волшебник. Но однажды прилетает сова с письмом для него, и жизнь Гарри Поттера изменяется навсегда. Гарри узнает, что он волшебник, встречает близких друзей и немало врагов в Школе Чародейства и Волшебства «Хогвартс», а также с помощью своих друзей пресекает попытку возвращения злого волшебника Лорда Волан-де-Морта.`,
        category: 'Приключения',
        price: 1000,
    },
    {
        id: uuidv4(),
        imageSrc: 'https://ir.ozone.ru/s3/multimedia-0/wc1000/6173645388.jpg',
        name: 'Гарри Поттер и Тайная Комната',
        descrContent: `Вторая часть из серии книг о Гарри Поттере. Книга рассказывает о втором учебном годе в школе чародейства и волшебства Хогвартс. В Школе чародейства и волшебства «Хогвартс» происходят тревожные события. Кто-то нападает на учеников школы, и преподаватели подозревают, что это таинственное чудовище, которое скрывается в легендарной Тайной комнате. Гарри Поттер и его друзья разгадывают загадку Тайной комнаты, и теперь Гарри снова предстоит сразиться с лордом Волан-де-Мортом. Сумеет ли он победить на этот раз?`,
        category: 'Приключения',
        price: 830,
    },
    {
        id: uuidv4(),
        imageSrc: 'https://ir.ozone.ru/s3/multimedia-z/wc1000/6157959431.jpg',
        name: 'Гарри Поттер и Узник Азкабана',
        descrContent: `Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Дж.К. Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и узник Азкабана» – история продолжается.`,
        category: 'Приключения',
        price: 830,
    },
];
